[{"title": "Braves' Profar gets 80-game ban for PED violation - ESPN", "source": "ESPN"}, {"title": "Trump targets ticket scalpers and high live event fees, which he calls ‘price-gouging’ - AP News", "source": "Associated Press"}, {"title": "Conservative News Channel Newsmax Skyrockets More Than 700% in IPO - Barron's", "source": "Barron's"}, {"title": "Trump has dubbed April 2 ‘Liberation Day’ for tariffs. Here’s what to expect - AP News", "source": "Associated Press"}, {"title": "Bodies of three out of four US soldiers whose vehicle was submerged in Lithuania are recovered - CNN", "source": "CNN"}, {"title": "High-Stakes Executive Drama Descends on CinemaCon: Who’s In, Who’s Out? - The Hollywood Reporter", "source": "Hollywood Reporter"}, {"title": "4 astronauts to be the first to orbit the poles on a privately funded SpaceX mission - NPR", "source": "NPR"}, {"title": "Wall Street is fed up with Trump’s tariffs. Stocks are off to their worst start to a year since 2022 - CNN", "source": "CNN"}, {"title": "Aaron Rodgers had throwing session with DK Metcalf as QB’s Steelers decision looms - New York Post", "source": "New York Post"}, {"title": "Marine Le Pen Found Guilty of Embezzlement, Banned From Next Election - WSJ", "source": "The Wall Street Journal"}, {"title": "Maryland basketball's collapse continues: Two 'Crab Five' stars hit transfer portal after Kevin Willard exits - CBS Sports", "source": "CBS Sports"}, {"title": "New FDA commissioner agreed to oust top vaccine regulator after private swearing-in - Politico", "source": "Politico"}, {"title": "9-year-old girl dies after going under anesthesia for dental procedure, reports say - AZFamily", "source": "AZFamily"}, {"title": "CERN releases report on the feasibility of a possible Future Circular Collider - Home | CERN", "source": "Home.cern"}, {"title": "Israel orders evacuation of southern Gaza city of Rafah - BBC", "source": "BBC News"}, {"title": "Rocket to Buy Mr. Cooper Group in $9.4 Billion Mortgage-Industry Deal - WSJ", "source": "The Wall Street Journal"}]