[
  {
    "title": "You know your calls are cooked when the board comes out",
    "score": 16719,
    "time": 1743625812.0
  },
  {
    "title": "Mr. Trumpland from a couple days ago chopped down dozens of trees on my parents' property - west MI",
    "score": 16801,
    "time": 1743617830.0
  },
  {
    "title": "Astronaut Leland Melvin’s official NASA photo included his two rescue dogs",
    "score": 11909,
    "time": 1743621634.0
  },
  {
    "title": "Trump kicks off sale of $2.3bn Truth Social stake",
    "score": 11342,
    "time": 1743619403.0
  },
  {
    "title": "man recognises woman having a seizure and catches her before she falls",
    "score": 10572,
    "time": 1743621371.0
  },
  {
    "title": "TIL King George V was given a lethal injection of cocaine and morphine (to preserve his dignity) so that his death, declared at 11:55 p.m., would be announced in the morning edition of The Times newspaper.",
    "score": 9872,
    "time": 1743620789.0
  },
  {
    "title": "Looking back at the time Arnold Schwarzenegger put a random internet troll in their place.",
    "score": 7526,
    "time": 1743625442.0
  },
  {
    "title": "Crescent pigeon performing its courtship dance to a shoe with pink \"feet\" like his own",
    "score": 12652,
    "time": 1743618268.0
  },
  {
    "title": "Always there was been double standard!",
    "score": 11521,
    "time": 1743618353.0
  },
  {
    "title": "🔥 A Crested pigeon performing its mating dance to a shoe with pink \"feet\" just like his",
    "score": 24381,
    "time": 1743611252.0
  },
  {
    "title": "Elevator Ride [OC]",
    "score": 8254,
    "time": 1743622895.0
  },
  {
    "title": "Yeah I kinda want to know also",
    "score": 16157,
    "time": 1743612736.0
  },
  {
    "title": "Russian strategic bomber crashes in Siberia, one person dead, governor says",
    "score": 10940,
    "time": 1743616118.0
  },
  {
    "title": "Representative Mikie Sherrill (NJ-11) Introduces Bill to Require Elon Musk to Pass Drug Test to Maintain Special Government Employee Status",
    "score": 15189,
    "time": 1743611883.0
  },
  {
    "title": "Elon Musk's super PAC America First wants to delete this video evidence of election interference off the internet. You know what to do. Fuck Musk!",
    "score": 37857,
    "time": 1743606766.0
  },
  {
    "title": "Lauren Boebert Suggests DC Could Be Renamed 'District of America'",
    "score": 14366,
    "time": 1743612450.0
  },
  {
    "title": "Emails Confirm Social Security Administration Canceled Maine Contracts As Political Payback",
    "score": 22090,
    "time": 1743607218.0
  },
  {
    "title": "Old growth lumber vs modern factory farmed lumber",
    "score": 21799,
    "time": 1743609751.0
  },
  {
    "title": "Meirl",
    "score": 11607,
    "time": 1743613469.0
  },
  {
    "title": "Not enough tater tots in the bag to finish my casserole!",
    "score": 12771,
    "time": 1743614470.0
  },
  {
    "title": "Elon Musk Loses a Billion Dollars Every Time the Tesla Stock Drops by $2.43",
    "score": 68315,
    "time": 1743603925.0
  },
  {
    "title": "People either voted for trump or against Kamala...for this?!",
    "score": 15627,
    "time": 1743609620.0
  },
  {
    "title": "For real, made my decission between those two for now",
    "score": 16338,
    "time": 1743609126.0
  },
  {
    "title": "Madlad salary booster:",
    "score": 8258,
    "time": 1743615897.0
  },
  {
    "title": "JUST IN: Representative Mikie Sherrill has introduced legislation to require drug testing for Elon Musk and DOGE",
    "score": 29142,
    "time": 1743602275.0
  }
]